### 오늘할일

디자인 수정 -진행중

하드웨어 → 아두이노 설비 소프트웨어(C#)랑 연결해서 공정들마다 구동하기 - 진행중

포스터 제작, 결과 보고서 제작, 발표PPT제작 -정동(ppt),란영(보고서) 진행중

각 폼에서 작업자 ID 임시로 들어가는거 WORKER 테이블의 WORKERID 컬럼 값 넣기 - 완료-

불량 오류 수정 → try catch - 완료-

로그인 폼 추가 및 테이블 교체-완료-

### 쿼리에서 select문에 * 말고 원하는 컬럼값 지정하기

### *******LOT 생성후 LOT완료시 반제품 호퍼에 추가 일단 무시*******

### 호퍼 저장소 자재량 조회 MIN, MAX 데이터 시각화 대화 필요

### 공정 설비 흐름 그대로 하는데 벗어나면 실행 안되게 해야하나? → 맨토님한태 ㄱㄱ

### 작업지시가 완료된 것은 계획수량이 생산한 수량이랑 같아야하는지 → 저 부분은 토요일에 설명드릴게요. 일단은 무시

![image.png](https://prod-files-secure.s3.us-west-2.amazonaws.com/c980be53-cfa0-48fe-96ef-3fbb86559cc7/253ca8a3-ecc2-4ff9-afdd-66ae6a68dfaf/image.png)

### 통합 UI 전체공정 페이지, 공정 애니메이션 흐름 설계

1. 현장과 통합 통신을 통한 공정 상태 받아와서 어떤 호기 가동 중인지 보여주기 - 2023년 기준
2. 타이머 넣어서 전체 공정 흐름만 보여주기 -2021, 2022년 기준
3. 2번처럼 전체 공정 흐름을 보여주는 것은 같고 각 공정마다 호기 램프 4개씩 줘서 설비상태보여주기(어떤 설비 작동중, 대기중 등등) 조회 시 상태 보여주기 - 오리지널 2024년
