/*
토요일 주말이지만 학교에 와서 6시그마 수업을 들었다. 오늘은 오전에 미니텝 사용법을 배워서 미리짠 조원들과 과제를 했다. 오후에 과제를 하고 시험을 치고 집와서 2차 미니프로젝트에서 필수 요소들의 틀을 구축했다.
밑에는 6시그마를 듣고 후기를 정리한 것이다.

6시그마에 대한 배경지식 없이 품질과 관련된 내용이라고만 알고 이번 과정에 참가했습니다. 처음 들어보는 단어와 내용이 많아서 초반에는 이해하기가 조금 버거웠습니다.
하지만 윤성필 박사님이 강의 중간중간 취업 할때 필요한 정보와 이해하기 쉽게 들어주시는 예시 덕분에 강의에 대한 흥미가 생겨 더 집중해서 시험까지 잘 마무리 할 수 있었던거 같습니다.
특히 품질,제품,공정에 대해 설명 해주신것이 기억에 남고 품질직무로 취업준비를 하게되면 어떤 부분을 준비해야하는지, 면접때 다른 사람들과 차별화된 답변을 하는 방법도 알려주셨습니다.
6시그마 뿐만 아니라 취업에 필요한 정보를 많이 공유해주셔서 더 유익한 시간이였던거 같습니다.

6시그마 교육을 통해 품질관리/생산 현장의 직무에서 채택되는 품질, 제품, 공정의 정의와 공정에 영향을 주는 5M.ETS에 대해 알게 되었으며
6시그마는 이를 고려하여 고객의 관점에서 사고하여 공정에서 문제가 생길 것 같은 공정변동을 제거하는 과정임을 이해하였습니다.
또한 tool을 통해 공정의 산포를 줄이고 불량을 제거하여 고객을 만족시키는 역량을 제공하는 방법론임을 배웠고 공정에서 생산된 100만개중 3.4개의 불량 률(DPMO)를 추구함을 배웠습니다.
6시그마는 과학적 문제 해결 방법을 통해 실제적 문제-통계적 문제- 통계적 해법- 실제적 해법의 단계를 거치며 주요 Vital Few X's를 발견하고 관리하는데 초점을 가진다는 것을 알게 되었습니다.
이를 비롯하여 기초 통계활용 및 데이터 분석 방법론에 대해 익혔으며 이는 모집단-샘플-자료-기술통계학-정보의 과정을 거치며
이가운데 통계의 정규분포를 따르는지 여부를 통해 공정의 안정성 파악 - 통계의 평균과 중위값의 동일 유무를 통해 공정의 균일성을 판단함을 알게 되었습니다.
특히나 Minitab 이라는 tool을 이용하여 나사볼트 주조공정 중 브레이크 부분의 월~금 까지의 경도측정 데이터를 활용해 팀프로젝트를 수행하며 단 시간 내에 그래프를 해석하는 방법과
첨도와 왜도/정규분포/A와P의 관계를 따져 공정의 균일성, 안정성을 파악해 나갔고 5M ETS 적으로 문제상황을 타개하는 방법들을 팀원들과 함께 고안해 낼 때 6시그마적으로 공정을 해석하는 이유와 문제상황에 대한 솔루션을 이해할 수 있었던매우 뜻깊은 시간이었습니다.
*/
